category.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-06 Mon 17:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf7011bf">1. category theory</a>
<ul>
<li><a href="#orge299551">1.1. small category</a></li>
<li><a href="#org31c9a30">1.2. product category</a></li>
</ul>
</li>
<li><a href="#orge031e3f">2. tranditional abstract algebra</a>
<ul>
<li><a href="#org366e72c">2.1. group by category</a></li>
</ul>
</li>
<li><a href="#org6b49690">3. Functor</a>
<ul>
<li><a href="#orgb4a0a6d">3.1. Free functor (informal term)</a></li>
<li><a href="#orgb9cb4b4">3.2. Definition: presheaf</a></li>
<li><a href="#org905e1e8">3.3. <span class="todo TODO">TODO</span> Definition: faithful</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf7011bf" class="outline-2">
<h2 id="orgf7011bf"><span class="section-number-2">1</span> category theory</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge299551" class="outline-3">
<h3 id="orge299551"><span class="section-number-3">1.1</span> small category</h3>
<div class="outline-text-3" id="text-1-1">
<p>
small category is a category such that all of its objects form a set and all of its morphisms form a set.
</p>
</div>
</div>

<div id="outline-container-org31c9a30" class="outline-3">
<h3 id="org31c9a30"><span class="section-number-3">1.2</span> product category</h3>
<div class="outline-text-3" id="text-1-2">
<p>
For any two categories ğ’œ, â„¬, we can build a product of them as a category, write as ğ’œÃ—â„¬
</p>

<p>
ğ’ªğ’·(ğ’œÃ—â„¬) = ğ’ªğ’·(ğ’œ) Ã— ğ’ªğ’·(â„¬)
(ğ’œÃ—â„¬)((A, B), (A', B')) = ğ’œ(A, A') Ã— â„¬(B, B')
</p>

<p>
As well, we define âˆ˜ as
</p>

<p>
(f, g) âˆ˜ (h, j) = (fâˆ˜h, gâˆ˜j)
</p>

<p>
and define identity of (A, B) as
</p>

<p>
1(A, B) = (1A, 1B)
</p>
</div>
</div>
</div>

<div id="outline-container-orge031e3f" class="outline-2">
<h2 id="orge031e3f"><span class="section-number-2">2</span> tranditional abstract algebra</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org366e72c" class="outline-3">
<h3 id="org366e72c"><span class="section-number-3">2.1</span> group by category</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The group axioms can be formed by category thinking, that's a small-category that
</p>

<ol class="org-ol">
<li>only has one object</li>
<li>all morphisms are isomorphisms</li>
</ol>

<p>
In this situtation, we have the following mapping
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">category â„­</th>
<th scope="col" class="org-left">corrresponding group G</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">morphisms in â„­</td>
<td class="org-left">elements of G</td>
</tr>

<tr>
<td class="org-left">â—‹ in â„­</td>
<td class="org-left">â‹… in G</td>
</tr>

<tr>
<td class="org-left">1â„­</td>
<td class="org-left">e âˆˆ G</td>
</tr>
</tbody>
</table>

<p>
A more advanced idea is, viewing group as a list of operations (partially applied <code>â‹… a</code>), with e as initial state
</p>

<p>
Then the category diagram will just reflect the idea
</p>
</div>
</div>
</div>

<div id="outline-container-org6b49690" class="outline-2">
<h2 id="org6b49690"><span class="section-number-2">3</span> Functor</h2>
<div class="outline-text-2" id="text-3">
<p>
A functor <code>F : ğ’œ â†’ â„¬</code> consists
</p>

<ol class="org-ol">
<li>function makes ğ’ªğ’·(ğ’œ) to ğ’ªğ’·(â„¬), write as A âŸ¶  F(A)</li>
<li>for every morphism <code>f : A â†’ A'</code> in ğ’œ, makes corrresponding morphism in â„¬, write as f âŸ¶  F(f)</li>
<li>composition of morphism are preserved</li>
<li>identities are preserved</li>
</ol>
</div>

<div id="outline-container-orgb4a0a6d" class="outline-3">
<h3 id="orgb4a0a6d"><span class="section-number-3">3.1</span> Free functor (informal term)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Given any set <code>S</code>, one can build the <b>free group</b> <code>F(S)</code> on <code>S</code>. For example, said <code>S = {x, y, z}</code>, insert <code>e</code>, <code>xâ»Â¹</code>, <code>yâ»Â¹</code>, <code>zâ»Â¹</code> makes a group (informally). Just like we have in mind, <code>x â‹… xâ»Â¹ = e</code>, and so on. This group is the <b>free group</b> of <code>{x, y, z}</code>. On the other hand, this <code>F</code> became a functor, from <b>Set</b> to <b>Grp</b>. Maps of sets <code>S</code>, <code>S'</code>, rise to a homomorphism of groups.
</p>

<p>
The same can be done for <b>Set</b> to <b>Vectâ‚–</b>, <b>Set</b> to <b>CRing</b>, and many. Such thing is what we called free functor, informally.
</p>
</div>
</div>

<div id="outline-container-orgb9cb4b4" class="outline-3">
<h3 id="orgb9cb4b4"><span class="section-number-3">3.2</span> Definition: presheaf</h3>
<div class="outline-text-3" id="text-3-2">
<p>
A presheaf on category ğ”„ is a functor ğ”„áµ’áµ– â†’ <b>Set</b>
</p>
</div>
</div>

<div id="outline-container-org905e1e8" class="outline-3">
<h3 id="org905e1e8"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> Definition: faithful</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-02-06 Mon 17:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
